testdata/transactions.xml

<?xml version="1.0" encoding="UTF-8"?>
<transactions type="array">
   <transaction href="https://your-subdomain.recurly.com/v2/transactions/a13acd8fe4294916b79aec87b7ea441f" type="credit_card">
      <account href="https://your-subdomain.recurly.com/v2/accounts/1" />
      <invoice href="https://your-subdomain.recurly.com/v2/invoices/1108" />
      <subscription href="https://your-subdomain.recurly.com/v2/subscriptions/17caaca1716f33572edc8146e0aaefde" />
      <uuid>a13acd8fe4294916b79aec87b7ea441f</uuid>
      <action>purchase</action>
      <amount_in_cents type="integer">1000</amount_in_cents>
      <tax_in_cents type="integer">0</tax_in_cents>
      <currency>USD</currency>
      <status>success</status>
      <description>Order #717</description>
      <payment_method>credit_card</payment_method>
      <reference>5416477</reference>
      <source>subscription</source>
      <recurring type="boolean">true</recurring>
      <test type="boolean">true</test>
      <voidable type="boolean">true</voidable>
      <refundable type="boolean">true</refundable>
      <ip_address>127.0.0.1</ip_address>
      <cvv_result code="M">Match</cvv_result>
      <avs_result code="D">Street address and postal code match.</avs_result>
      <avs_result_street nil="nil" />
      <avs_result_postal nil="nil" />
      <created_at type="datetime">2015-06-10T15:25:06Z</created_at>
      <details>
         <account>
            <account_code>1</account_code>
            <first_name>Verena</first_name>
            <last_name>Example</last_name>
            <company nil="nil" />
            <email>verena@test.com</email>
            <billing_info type="credit_card">
               <first_name>Verena</first_name>
               <last_name>Example</last_name>
               <address1>123 Main St.</address1>
               <address2 nil="nil" />
               <city>San Francisco</city>
               <state>CA</state>
               <zip>94105</zip>
               <country>US</country>
               <phone nil="nil" />
               <vat_number nil="nil" />
               <card_type>Visa</card_type>
               <year type="integer">2017</year>
               <month type="integer">11</month>
               <first_six>411111</first_six>
               <last_four>1111</last_four>
            </billing_info>
         </account>
      </details>
      <a name="refund" href="https://your-subdomain.recurly.com/v2/transactions/a13acd8fe4294916b79aec87b7ea441f" method="delete" />
   </transaction>
</transactions>